### I) loading Dataframes df1 & df2

In [1]:
import pandas as pd
df1 = pd.read_csv('../data/grades.csv', index_col=[0])
df2 = pd.read_csv('../data/students.csv', index_col=[0])

### II).	display df1 & df2 frist 5 rows

In [2]:
df1.head()

            Grade  Address
ID_student
1              95  Chennai
2              70    Delhi
3              98   Mumbai
4              75     Pune
5              89    Kochi

In [3]:
df2.head()

            Age     Sex         GD Employed
ID_student
1            19    Male  1st Class      yes
2            20  Female  2nd Class       no
3            18    Male  1st Class       no
4            21  Female  2nd Class       no
5            19    Male  1st Class       no

### II) concatenate both Dataframe

In [4]:
df = pd.merge(df1, df2, on = 'ID_student')

In [5]:
df.head()

            Grade  Address  Age     Sex         GD Employed
ID_student
1              95  Chennai   19    Male  1st Class      yes
2              70    Delhi   20  Female  2nd Class       no
3              98   Mumbai   18    Male  1st Class       no
4              75     Pune   21  Female  2nd Class       no
5              89    Kochi   19    Male  1st Class       no